In [2]:
import os
import numpy as np
import pandas as pd

In [3]:
# 設定 data_path
dir_data = './data/'

#### 讀取資料

In [4]:
f_app = os.path.join(dir_data, 'application_train.csv')
print('Path of read in data: %s' % (f_app))
df = pd.read_csv(f_app)

Path of read in data: ./data/application_train.csv

#### 資料的 row 數以及 column 數

In [40]:
print("row數:{}".format(len(df)))
print("column數:{}".format(len(list(df.columns))))

row數:307511
column數:122

#### 資料的資訊

In [41]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 307511 entries, 0 to 307510
Columns: 122 entries, SK_ID_CURR to AMT_REQ_CREDIT_BUREAU_YEAR
dtypes: float64(65), int64(41), object(16)
memory usage: 286.2+ MB

#### 列出所有欄位

In [56]:
col = list(df.columns)
print("所有欄位:")
for i in range(122):
    print("{}. {}".format(i+1,col[i]))

所有欄位:
1. SK_ID_CURR
2. TARGET
3. NAME_CONTRACT_TYPE
4. CODE_GENDER
5. FLAG_OWN_CAR
6. FLAG_OWN_REALTY
7. CNT_CHILDREN
8. AMT_INCOME_TOTAL
9. AMT_CREDIT
10. AMT_ANNUITY
11. AMT_GOODS_PRICE
12. NAME_TYPE_SUITE
13. NAME_INCOME_TYPE
14. NAME_EDUCATION_TYPE
15. NAME_FAMILY_STATUS
16. NAME_HOUSING_TYPE
17. REGION_POPULATION_RELATIVE
18. DAYS_BIRTH
19. DAYS_EMPLOYED
20. DAYS_REGISTRATION
21. DAYS_ID_PUBLISH
22. OWN_CAR_AGE
23. FLAG_MOBIL
24. FLAG_EMP_PHONE
25. FLAG_WORK_PHONE
26. FLAG_CONT_MOBILE
27. FLAG_PHONE
28. FLAG_EMAIL
29. OCCUPATION_TYPE
30. CNT_FAM_MEMBERS
31. REGION_RATING_CLIENT
32. REGION_RATING_CLIENT_W_CITY
33. WEEKDAY_APPR_PROCESS_START
34. HOUR_APPR_PROCESS_START
35. REG_REGION_NOT_LIVE_REGION
36. REG_REGION_NOT_WORK_REGION
37. LIVE_REGION_NOT_WORK_REGION
38. REG_CITY_NOT_LIVE_CITY
39. REG_CITY_NOT_WORK_CITY
40. LIVE_CITY_NOT_WORK_CITY
41. ORGANIZATION_TYPE
42. EXT_SOURCE_1
43. EXT_SOURCE_2
44. EXT_SOURCE_3
45. APARTMENTS_AVG
46. BASEMENTAREA_AVG
47. YEARS_BEGINEXPLUATATION_AVG
48. YEARS_BUILD_AVG
49. COMMONAREA_AVG
50. ELEVATORS_AVG
51. ENTRANCES_AVG
52. FLOORSMAX_AVG
53. FLOORSMIN_AVG
54. LANDAREA_AVG
55. LIVINGAPARTMENTS_AVG
56. LIVINGAREA_AVG
57. NONLIVINGAPARTMENTS_AVG
58. NONLIVINGAREA_AVG
59. APARTMENTS_MODE
60. BASEMENTAREA_MODE
61. YEARS_BEGINEXPLUATATION_MODE
62. YEARS_BUILD_MODE
63. COMMONAREA_MODE
64. ELEVATORS_MODE
65. ENTRANCES_MODE
66. FLOORSMAX_MODE
67. FLOORSMIN_MODE
68. LANDAREA_MODE
69. LIVINGAPARTMENTS_MODE
70. LIVINGAREA_MODE
71. NONLIVINGAPARTMENTS_MODE
72. NONLIVINGAREA_MODE
73. APARTMENTS_MEDI
74. BASEMENTAREA_MEDI
75. YEARS_BEGINEXPLUATATION_MEDI
76. YEARS_BUILD_MEDI
77. COMMONAREA_MEDI
78. ELEVATORS_MEDI
79. ENTRANCES_MEDI
80. FLOORSMAX_MEDI
81. FLOORSMIN_MEDI
82. LANDAREA_MEDI
83. LIVINGAPARTMENTS_MEDI
84. LIVINGAREA_MEDI
85. NONLIVINGAPARTMENTS_MEDI
86. NONLIVINGAREA_MEDI
87. FONDKAPREMONT_MODE
88. HOUSETYPE_MODE
89. TOTALAREA_MODE
90. WALLSMATERIAL_MODE
91. EMERGENCYSTATE_MODE
92. OBS_30_CNT_SOCIAL_CIRCLE
93. DEF_30_CNT_SOCIAL_CIRCLE
94. OBS_60_CNT_SOCIAL_CIRCLE
95. DEF_60_CNT_SOCIAL_CIRCLE
96. DAYS_LAST_PHONE_CHANGE
97. FLAG_DOCUMENT_2
98. FLAG_DOCUMENT_3
99. FLAG_DOCUMENT_4
100. FLAG_DOCUMENT_5
101. FLAG_DOCUMENT_6
102. FLAG_DOCUMENT_7
103. FLAG_DOCUMENT_8
104. FLAG_DOCUMENT_9
105. FLAG_DOCUMENT_10
106. FLAG_DOCUMENT_11
107. FLAG_DOCUMENT_12
108. FLAG_DOCUMENT_13
109. FLAG_DOCUMENT_14
110. FLAG_DOCUMENT_15
111. FLAG_DOCUMENT_16
112. FLAG_DOCUMENT_17
113. FLAG_DOCUMENT_18
114. FLAG_DOCUMENT_19
115. FLAG_DOCUMENT_20
116. FLAG_DOCUMENT_21
117. AMT_REQ_CREDIT_BUREAU_HOUR
118. AMT_REQ_CREDIT_BUREAU_DAY
119. AMT_REQ_CREDIT_BUREAU_WEEK
120. AMT_REQ_CREDIT_BUREAU_MON
121. AMT_REQ_CREDIT_BUREAU_QRT
122. AMT_REQ_CREDIT_BUREAU_YEAR

#### 截取部分資料(頭)

In [48]:
df2 = df[['SK_ID_CURR','TARGET','NAME_CONTRACT_TYPE','CODE_GENDER','FLAG_OWN_CAR']]
df2.head()

   SK_ID_CURR  TARGET NAME_CONTRACT_TYPE CODE_GENDER FLAG_OWN_CAR
0      100002       1         Cash loans           M            N
1      100003       0         Cash loans           F            N
2      100004       0    Revolving loans           M            Y
3      100006       0         Cash loans           F            N
4      100007       0         Cash loans           M            N

#### 擷取部分資料(尾)

In [49]:
df2.tail()

        SK_ID_CURR  TARGET NAME_CONTRACT_TYPE CODE_GENDER FLAG_OWN_CAR
307506      456251       0         Cash loans           M            N
307507      456252       0         Cash loans           F            N
307508      456253       0         Cash loans           F            N
307509      456254       1         Cash loans           F            N
307510      456255       0         Cash loans           F            N

#### 資料選擇

In [43]:
df2[df2.columns[0:3]][0:8]

   SK_ID_CURR  TARGET NAME_CONTRACT_TYPE
0      100002       1         Cash loans
1      100003       0         Cash loans
2      100004       0    Revolving loans
3      100006       0         Cash loans
4      100007       0         Cash loans
5      100008       0         Cash loans
6      100009       0         Cash loans
7      100010       0         Cash loans

#### 資料新增

In [44]:
df2.insert(0,column='Insert_Test',value = '0')
df2['Insert_Test'][0:5]

0    0
1    0
2    0
3    0
4    0
Name: Insert_Test, dtype: object

#### 資料更新

In [45]:
df2.loc[2:4,'Insert_Test'] = [2,2,2]
df2['Insert_Test'][0:5]

0    0
1    0
2    2
3    2
4    2
Name: Insert_Test, dtype: object

#### 刪除欄位

In [46]:
df2 = df2.drop(['Insert_Test'],axis=1)
df2.head()

   SK_ID_CURR  TARGET NAME_CONTRACT_TYPE CODE_GENDER FLAG_OWN_CAR
0      100002       1         Cash loans           M            N
1      100003       0         Cash loans           F            N
2      100004       0    Revolving loans           M            Y
3      100006       0         Cash loans           F            N
4      100007       0         Cash loans           M            N

#### 資料過濾

In [37]:
fil = (df2['NAME_CONTRACT_TYPE'] == 'Cash loans')
df2[fil].head()

   SK_ID_CURR  TARGET NAME_CONTRACT_TYPE CODE_GENDER FLAG_OWN_CAR
0      100002       1         Cash loans           M            N
1      100003       0         Cash loans           F            N
3      100006       0         Cash loans           F            N
4      100007       0         Cash loans           M            N
5      100008       0         Cash loans           M            N

#### 資料清理

In [50]:
df2 = df2.dropna() #刪除NAN資料

#### 資料排序

In [51]:
df2.sort_values("CODE_GENDER",ascending=False).head()

        SK_ID_CURR  TARGET NAME_CONTRACT_TYPE CODE_GENDER FLAG_OWN_CAR
35657       141289       0    Revolving loans         XNA            Y
83382       196708       0    Revolving loans         XNA            N
38566       144669       0    Revolving loans         XNA            N
189640      319880       0    Revolving loans         XNA            Y
237209      374751       0         Cash loans           M            N